/*
****************************************************************************
* Copyright(C): TY Technology
* FileName    : delay.c
* Description : 延时
****************************************************************************
*/

#include "typedef.h"
#include "delay.h"



/*
********************************************************************************
* Function Name  : delay
* Description    : 粗延时函数,延时n*5个系统时钟
* Parameter      : - n: 延时时长
* Return         : None
********************************************************************************
*/
void delay(UINT32 n)
{
    while (n)
    {
        n--;
    }
}


/*
********************************************************************************
* Function Name  : delay_ms
* Description    : 延时 n 毫秒，延时太长不精确，延时时长最好在秒以下
* Parameter      : - n: 毫秒数
* Return         : None
********************************************************************************
*/
void delay_ms(UINT32 n)
{
    while (n--)
    {
        delay_us(1000);
    }
}



