/*
****************************************************************************
* Copyright(C): TY Technical
* FileName    : delay.c
* Description : 延时
****************************************************************************
*/

#include "delay.h"

/*
********************************************************************************
* Function Name  : delay_us
* Description    : 粗延时函数,延时n*5个系统时钟
* Input          : - Nus: 延时时长
* Output         : None
* Return         : None
********************************************************************************
*/
void delay_us(u32 Nus)
{
    u16 i, j;
    u8  x = 0;
    for(i = 0; i < Nus; i++)
    {
      for(j = 0; j < 10; j++)
      {
        x++;
      }
    }
//    while (Nus--)
//    {
//        i = 10;
//        while (i--);
//    }
}


/*
********************************************************************************
* Function Name  : delay_ms
* Description    : 延时 Nms 毫秒，延时太长不精确，延时时长最好在秒以下
* Input          : - Nms: 毫秒数
* Output         : None
* Return         : None
********************************************************************************
*/
void delay_ms(u32 Nms)
{
    u16 i;
    while (Nms--)
    {
        i = 12000;
        while (i--);
    }
}

